"S3 (Amazon Simple Storage Service)" = "S3 (Amazon Simple Storage Service)";

/* Use your Access Key ID as the value of the AWSAccessKeyId parameter in requests you send to Amazon Web Services (when required). Your Access Key ID identifies you as the party responsible for the request. */
"Access Key ID" = "Access Key ID";

/* Since your Access Key ID is not encrypted in requests to AWS, it could be discovered and used by anyone. Services that are not free require you to provide additional information, a request signature, to verify that a request containing your unique Access Key ID could only have come from you. */
"Secret Access Key" = "Secret Access Key";

/* The current status of the distribution. When the status is Deployed, the distribution's information is fully propagated throughout the Amazon CloudFront system. */
"InProgress" = "W trakcie";

/* The current status of the distribution. When the status is Deployed, the distribution's information is fully propagated throughout the Amazon CloudFront system. */
"Deployed" = "Wdrożony";

"eu-west-1" = "EU (Ireland)";
"eu-west-2" = "EU (London)";
"eu-west-3" = "EU (Paris)";
"eu-north-1" = "EU (Stockholm)";
"eu-south-1" = "EU (Milan)";
"eu-south-2" = "EU (Hiszpania)";
"us-east-1" = "US East (Northern Virginia)";
"us-west-1" = "US West (Northern California)";
"us-west-2" = "US West (Oregon)";
"ap-southeast-1" = "Asia Pacific (Singapore)";
"ap-northeast-1" = "Asia Pacific (Tokyo)";
"sa-east-1" = "South America (São Paulo)";
"ap-southeast-1" = "Asia Pacific (Singapore)";
"ap-southeast-2" = "Asia Pacific (Sydney)";
"ap-southeast-3" = "Azja i Pacyfik (Dżakarta)";
"ap-southeast-4" = "Azja i Pacyfik (Melbourne)";
"ap-southeast-5" = "Azja i Pacyfik (Kuala Lumpur)";
"eu-central-1" = "EU (Frankfurt)";
"eu-central-2" = "UE (Zurych)";
"us-east-2" = "US East (Ohio)";
"ap-northeast-2" = "Asia Pacific (Seoul)";
"ap-northeast-3" = "Asia Pacific (Osaka)";
"ap-south-1" = "Asia Pacific (Mumbai)";
"ap-south-2" = "Azja i Pacyfik (Hyderabad)";
"ap-east-1" = "Asia Pacific (Hong Kong)";
"ca-central-1" = "Canada (Montreal)";
"ca-west-1" = "Kanada Zachodnia (Calgary)";
"cn-north-1" = "China (Beijing)";
"cn-northwest-1" = "China (Ningxia)";
"me-south-1" = "Middle East (Bahrain)";
"af-south-1" = "Africa (Cape Town)";
"me-central-1" = "Bliski Wschód (UAE)";
"il-central-1" = "Izrael (Tel Awiw)";
"ap-east-2" = "Azja i Pacyfik (Tajpej)";
"ap-southeast-7" = "Azja i Pacyfik (Tajlandia)";
"mx-central-1" = "Meksyk (Centralny)";

/* Delivery methods including streaming protocols. */ 
"Download (HTTP)" = "Pobieranie (HTTP) CDN";
"Streaming (RTMP)" = "Transmisja strumieniowa (RTMP) CDN";
"Custom Origin Server (HTTP/HTTPS)" = "Własny serwer Origin (HTTP/HTTPS) CDN";

/* S3 Website Configuration (HTTP) with index document */
"Website Configuration (HTTP)" = "Konfiguracja witryny internetowej (HTTP)";
"NoSuchWebsiteConfiguration" = "Określony zasób nie ma konfiguracji witryny";

/* Storage class */
"STANDARD" = "Standardowe przechowywanie danych";
"STANDARD_IA" = "Standard IA (Infrequent Access)";
"INTELLIGENT_TIERING" = "Intelligent-Tiering";
"ONEZONE_IA" = "One Zone-Infrequent Access";
"REDUCED_REDUNDANCY" = "Pamięć masowa o obniżonej redundancji (RRS)";
"GLACIER" = "Glacier";
"DEEP_ARCHIVE" = "Glacier Deep Archive";
"GLACIER_IR" = "Natychmiastowe odzyskiwanie Glacier";

/* Google Storage Regions */
"us" = "United States";
"eu" = "European Union";
"asia" = "Asia";

/* Google Storage */
"MULTI_REGIONAL" = "Multi-Regional";
"REGIONAL" = "Regional Storage";
"NEARLINE" = "Nearline Storage";
"COLDLINE" = "Coldline Storage";
"ARCHIVE" = "Archive Storage";

/* Google Login Credentials */
"Google Account Email" = "Adres e-mail konta Google";
"Google Account Password" = "Hasło do konta Google";

/* MFA */
"Multi-Factor Authentication" = "Uwierzytelnianie wieloskładnikowe";
"MFA Serial Number" = "Numer seryjny MFA ";
"MFA Authentication Code" = "Kod uwierzytelniania MFA";

/* ACL Editing */
"Canonical User ID" = "Kanoniczny identyfikator użytkownika";
"Email Address" = "Adres e-mail";

/* Amazon Related ACL Scopes */
"Amazon Customer Email Address" = "Adres e-mail klienta Amazon";

/* Google Storage Related ACL Scopes */
"Google Account Email Address" = "Adres e-mail konta Google";
"Google Group Email Address" = "Adres e-mail grupy Google";
"Google Apps Domain" = "Adres e-mail grupy Google";

"http://acs.amazonaws.com/groups/global/AuthenticatedUsers" = "Any AWS authenticated user";
"http://acs.amazonaws.com/groups/global/AllUsers" = "Wszyscy";
"http://acs.amazonaws.com/groups/s3/LogDelivery" = "Log dostawy";
"AllUsers" ="Wszyscy";
"Google Account Holders" =  "Google Account Holders";

/* Signed URL Expiry */
"Pre-Signed" = "Pre-Signed";
"Expires {0}" = "Wygasa {0}";

/* HTTP Metadata */
"Custom Header" = "Niestandardowy nagłówek";

/* CloudFront object invalidation */
"{0} invalidations in progress" = "{0} unieważnienia w toku";
"{0} invalidations completed" = "{0} unieważnienia zakończone";

"Bucket name is not DNS compatible" = "Nazwa zasobu nie jest zgodna z DNS";

/* Lifecyle configuration */
"after {0} Days" = "po {0} dniach";
